app/controllers/admin_users_controller.rb

  def create
  		@admin_user = AdminUser.new(admin_user_params)
  		if @admin_user.save
---
INSERT INTO `admin_users` (`first_name`, `last_name`, `email`, `username`, `created_at`, `updated_at`, `password_digest`) VALUES ('ram', 'pandu', 'ram_pandu@gamil.com', 'ram_pandu', '2018-01-21 17:52:03', '2018-01-21 17:52:03', '$2a$10$59zdw/Ov/U14NxkW.3ZflucRQMar1v0ZQU/R1OIlcPnn6mak0IFh2')

  def edit
    @admin_user = AdminUser.find(params[:id])
---
SELECT  `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1

  def update
  		@admin_user = AdminUser.find(params[:id])
  		if @admin_user.update_attributes(admin_user_params)
---
SELECT  `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1
UPDATE `admin_users` SET `password_digest` = '$2a$10$Esu2VRMwGeVC..VRcRHZF.JdkawLzpFyQ7Tfcl8dXkS5lwlTsCToa', `updated_at` = '2018-01-19 09:28:55' WHERE `admin_users`.`id` = 1