app/controllers/pages_controller.rb

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
---
  def edit
     @page = Page.find(params[:id])

SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
UPDATE `pages` SET `visible` = 1, `updated_at` = '2018-01-19 11:48:34' WHERE `pages`.`id` = 1
---
  def update
    @page = Page.find(params[:id])

      if @page.update_attributes(page_params)

SELECT COUNT(*) FROM `pages`
---
    def set_page_count
      @page_count = Page.count