app/controllers/public_controller.rb

  def show
  	@page = Page.visible.where(:permalink => params[:permalink]).first
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`visible` = 1 AND `pages`.`permalink` = 'first' ORDER BY `pages`.`id` ASC LIMIT 1