app/controllers/sections_controller.rb

SELECT COUNT(*) FROM `sections`
---
  def new
    @section  = Section.new({:name => 'Default'})
      @section_count = Section.count + 1

INSERT INTO `sections` (`page_id`, `name`, `position`, `visible`, `content_type`, `content`, `created_at`, `updated_at`) VALUES (1, 'second sections', 1, 1, 'text', 'helll this is text', '2018-01-19 11:20:54', '2018-01-19 11:20:54')
---
  def create
       @section  = Section.new(section_params)

      if  @section .save

SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `sections`
---
  def edit
      @section  = Section.find(params[:id])
       @section_count = Section.count

SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
UPDATE `sections` SET `visible` = 1, `content_type` = 'text', `content` = '<strong> this</strong> ravi', `updated_at` = '2018-01-19 11:23:07' WHERE `sections`.`id` = 1
---
  def update
   @section  = Section.find(params[:id])

      if  @section.update_attributes(section_params)