app/controllers/subjects_controller.rb

SELECT COUNT(*) FROM `subjects`
---
  def new
    @subject = Subject.new({:name => 'Default'})
    @subject_count = Subject.count + 1

INSERT INTO `subjects` (`name`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('sixsubject', 5, 1, '2018-01-21 17:53:00', '2018-01-21 17:53:51')
---
  def create
      @subject = Subject.new(subject_params)

      if @subject.save